In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv("examples/ex1.csv")

In [3]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [4]:
pd.read_table("examples/ex1.csv", sep=",") # utilizando o table tem que colocar o sep

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [5]:
pd.read_csv('examples/ex2.csv', header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [6]:
pd.read_csv('examples/ex2.csv', names=['a', 'b', 'c', 'd', 'message']) # colunas names

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [7]:
names=['a', 'b', 'c', 'd', 'message']

In [8]:
pd.read_csv('examples/ex2.csv', names=names, index_col='message') # nome

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [9]:
parsed = pd.read_csv('examples/csv_mindex.csv')
parsed

  key1 key2  value1  value2
0  one    a       1       2
1  one    b       3       4
2  one    c       5       6
3  one    d       7       8
4  two    a       9      10
5  two    b      11      12
6  two    c      13      14
7  two    d      15      16

In [10]:
parsed = pd.read_csv('examples/csv_mindex.csv', index_col=['key1', 'key2']) # key1 representa o one e two, basta olhar na tabela
# de cima
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [11]:
parsed = pd.read_csv('examples/csv_mindex.csv', index_col=['key1', 'key2']) # key1 representa o one e two, basta olhar na tabela
# de cima
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [12]:
parsed.index

MultiIndex([('one', 'a'),
            ('one', 'b'),
            ('one', 'c'),
            ('one', 'd'),
            ('two', 'a'),
            ('two', 'b'),
            ('two', 'c'),
            ('two', 'd')],
           names=['key1', 'key2'])

In [14]:
parsed.columns

Index(['value1', 'value2'], dtype='object')

In [15]:
list(open('examples/ex3.txt'))

['            A         B         C\n',
 'aaa -0.264438 -1.026059 -0.619500\n',
 'bbb  0.927272  0.302904 -0.032399\n',
 'ccc -0.264273 -0.386314 -0.217601\n',
 'ddd -0.871858 -0.348382  1.100491\n']

In [28]:
result = pd.read_table('examples/ex3.txt')
result

               A         B         C
0  aaa -0.264438 -1.026059 -0.619500
1  bbb  0.927272  0.302904 -0.032399
2  ccc -0.264273 -0.386314 -0.217601
3  ddd -0.871858 -0.348382  1.100491

In [29]:
result = pd.read_table('examples/ex3.txt', sep='\s+') # \s+ =  espaço entre os valores
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [130]:
pd.read_csv('examples/ex4.csv')

                                                                      # hey!
a                                                  b        c   d    message
# just wanted to make things more difficult for... NaN      NaN NaN      NaN
# who reads CSV files with computers                anyway? NaN NaN      NaN
1                                                  2        3   4      hello
5                                                  6        7   8      world
9                                                  10       11  12       foo

In [133]:
pd.read_csv('examples/ex4.csv', skiprows=[0, 2, 3]) # Pulando as linhas

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [6]:
dados = pd.read_csv('examples/ex4.csv', skiprows=[0, 2, 3]) # Pulando as linhas
dados

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [7]:
dados['a']

0    1
1    5
2    9
Name: a, dtype: int64

In [3]:
result = pd.read_csv('examples/ex5.csv')
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [4]:
pd.isnull(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [7]:
result = pd.read_csv('examples/ex5.csv')
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [16]:
sentinels = {'message': ['foo', 'NA'], 'something': ['two', np.nan]}
sentinels

{'message': ['foo', 'NA'], 'something': ['two', nan]}

In [17]:
pd.DataFrame(sentinels)

  message something
0     foo       two
1      NA       NaN

In [18]:
pd.read_csv('examples/ex5.csv', na_values=sentinels) #na values só onde tem valores colocam o NaN

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

In [19]:
## Lendo arquivos-textos em partes

In [20]:
pd.options.display.max_rows = 10

In [21]:
result = pd.read_csv('examples/ex6.csv')

In [22]:
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [25]:
result = pd.read_csv('examples/ex6.csv', nrows=5) # ler apenas 5 linhas

In [26]:
result

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [32]:
result = pd.read_csv('examples/ex6.csv', nrows=5, names=['um', 'dois', 'três', 'quarto', 'quinto'])
result

                um              dois             três            quarto quinto
0              one               two            three              four    key
1   0.467976300189  -0.0386485396255  -0.295344251987    -1.82472622729      L
2  -0.358893469543     1.40445260007   0.704964644926   -0.200638304015      B
3   -0.50184039929    0.659253707223  -0.421690619312  -0.0576883018364      G
4   0.204886212202     1.07413396504    1.38836131252   -0.982404023494      R

In [45]:
chunker = pd.read_csv('examples/ex6.csv', chunksize=1000)
chunker

In [49]:
for piece in chunker:
    print(piece)

           one       two     three      four key
1000  0.467976 -0.038649 -0.295344 -1.824726   T
1001 -0.358893  1.404453  0.704965 -0.200638   J
1002 -0.501840  0.659254 -0.421691 -0.057688   R
1003  0.204886  1.074134  1.388361 -0.982404   S
1004  0.354628 -0.133116  0.283763 -0.837063   B
...        ...       ...       ...       ...  ..
1995  2.311896 -0.417070 -1.409599 -0.515821   L
1996 -0.479893 -0.650419  0.745152 -0.646038   J
1997  0.523331  0.787112  0.486066  1.093156   V
1998 -0.362559  0.598894 -1.843201  0.887292   W
1999 -0.096376 -1.012999 -0.657431 -0.573315   D

[1000 rows x 5 columns]
           one       two     three      four key
2000  0.467976 -0.038649 -0.295344 -1.824726   1
2001 -0.358893  1.404453  0.704965 -0.200638   H
2002 -0.501840  0.659254 -0.421691 -0.057688   F
2003  0.204886  1.074134  1.388361 -0.982404   L
2004  0.354628 -0.133116  0.283763 -0.837063   E
...        ...       ...       ...       ...  ..
2995  2.311896 -0.417070 -1.409599 -0.515821   H
2996 -0.479893 -0.650419  0.745152 -0.646038   U
2997  0.523331  0.787112  0.486066  1.093156   A
2998 -0.362559  0.598894 -1.843201  0.887292   Y
2999 -0.096376 -1.012999 -0.657431 -0.573315   F

[1000 rows x 5 columns]
           one       two     three      four key
3000  0.467976 -0.038649 -0.295344 -1.824726   H
3001 -0.358893  1.404453  0.704965 -0.200638   Y
3002 -0.501840  0.659254 -0.421691 -0.057688   0
3003  0.204886  1.074134  1.388361 -0.982404   Z
3004  0.354628 -0.133116  0.283763 -0.837063   U
...        ...       ...       ...       ...  ..
3995  2.311896 -0.417070 -1.409599 -0.515821   W
3996 -0.479893 -0.650419  0.745152 -0.646038   E
3997  0.523331  0.787112  0.486066  1.093156   Q
3998 -0.362559  0.598894 -1.843201  0.887292   A
3999 -0.096376 -1.012999 -0.657431 -0.573315   M

[1000 rows x 5 columns]
           one       two     three      four key
4000  0.467976 -0.038649 -0.295344 -1.824726   H
4001 -0.358893  1.404453  0.704965 -0.200638   Z
4002 -0.501840  0.659254 -0.421691 -0.057688   2
4003  0.204886  1.074134  1.388361 -0.982404   B
4004  0.354628 -0.133116  0.283763 -0.837063   1
...        ...       ...       ...       ...  ..
4995  2.311896 -0.417070 -1.409599 -0.515821   X
4996 -0.479893 -0.650419  0.745152 -0.646038   M
4997  0.523331  0.787112  0.486066  1.093156   5
4998 -0.362559  0.598894 -1.843201  0.887292   T
4999 -0.096376 -1.012999 -0.657431 -0.573315   U

[1000 rows x 5 columns]
           one       two     three      four key
5000  0.467976 -0.038649 -0.295344 -1.824726   1
5001 -0.358893  1.404453  0.704965 -0.200638   Z
5002 -0.501840  0.659254 -0.421691 -0.057688   3
5003  0.204886  1.074134  1.388361 -0.982404   H
5004  0.354628 -0.133116  0.283763 -0.837063   B
...        ...       ...       ...       ...  ..
5995  2.311896 -0.417070 -1.409599 -0.515821   1
5996 -0.479893 -0.650419  0.745152 -0.646038   Y
5997  0.523331  0.787112  0.486066  1.093156   F
5998 -0.362559  0.598894 -1.843201  0.887292   0
5999 -0.096376 -1.012999 -0.657431 -0.573315   3

[1000 rows x 5 columns]
           one       two     three      four key
6000  0.467976 -0.038649 -0.295344 -1.824726   I
6001 -0.358893  1.404453  0.704965 -0.200638   X
6002 -0.501840  0.659254 -0.421691 -0.057688   A
6003  0.204886  1.074134  1.388361 -0.982404   C
6004  0.354628 -0.133116  0.283763 -0.837063   S
...        ...       ...       ...       ...  ..
6995  2.311896 -0.417070 -1.409599 -0.515821   P
6996 -0.479893 -0.650419  0.745152 -0.646038   9
6997  0.523331  0.787112  0.486066  1.093156   L
6998 -0.362559  0.598894 -1.843201  0.887292   5
6999 -0.096376 -1.012999 -0.657431 -0.573315   O

[1000 rows x 5 columns]
           one       two     three      four key
7000  0.467976 -0.038649 -0.295344 -1.824726   1
7001 -0.358893  1.404453  0.704965 -0.200638   I
7002 -0.501840  0.659254 -0.421691 -0.057688   H
7003  0.204886  1.074134  1.388361 -0.982404   P
7004  0.354628 -0.133116  0.283763 -0.837063   D
...        ...       ...       ...       ...  ..
7995  2.311896 -0.417070 -1.409599 -0.515821   A
7996 -0.479893 -0.650419  0.745152 -0.646038   6
7997  0.523331  0.787112  0.486066  1.093156   R
7998 -0.362559  0.598894 -1.843201  0.887292   R
7999 -0.096376 -1.012999 -0.657431 -0.573315   2

[1000 rows x 5 columns]
           one       two     three      four key
8000  0.467976 -0.038649 -0.295344 -1.824726   7
8001 -0.358893  1.404453  0.704965 -0.200638   W
8002 -0.501840  0.659254 -0.421691 -0.057688   C
8003  0.204886  1.074134  1.388361 -0.982404   S
8004  0.354628 -0.133116  0.283763 -0.837063   H
...        ...       ...       ...       ...  ..
8995  2.311896 -0.417070 -1.409599 -0.515821   W
8996 -0.479893 -0.650419  0.745152 -0.646038   N
8997  0.523331  0.787112  0.486066  1.093156   Q
8998 -0.362559  0.598894 -1.843201  0.887292   R
8999 -0.096376 -1.012999 -0.657431 -0.573315   M

[1000 rows x 5 columns]
           one       two     three      four key
9000  0.467976 -0.038649 -0.295344 -1.824726   B
9001 -0.358893  1.404453  0.704965 -0.200638   M
9002 -0.501840  0.659254 -0.421691 -0.057688   N
9003  0.204886  1.074134  1.388361 -0.982404   N
9004  0.354628 -0.133116  0.283763 -0.837063   Y
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[1000 rows x 5 columns]

In [53]:
tot = pd.Series([])
for piece in chunker:
    tot = tot.add(piece['key'].values_counts(), fill_value=0)
tot = tot.sort_values(ascending=False)

<ipython-input-53-95f2ca207937>:1: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  tot = pd.Series([])

In [54]:
tot[:10]

Series([], dtype: float64)

In [55]:
# Escrevendo dados em formato-texto

In [56]:
data = pd.read_csv('examples/ex5.csv')
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [60]:
data.to_csv('examples/teste.csv') # pega os dados e transforma em um csv

In [63]:
pd.read_csv('examples/teste.csv')

   Unnamed: 0 something  a   b     c   d message
0           0       one  1   2   3.0   4     NaN
1           1       two  5   6   NaN   8   world
2           2     three  9  10  11.0  12     foo

In [65]:
import sys
data.to_csv(sys.stdout, sep='|') # representa no console

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [66]:
data.to_csv(sys.stdout, na_rep='NULL')

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

In [67]:
data.to_csv(sys.stdout, index=False, header=False) # index e header falsos

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

In [68]:
data.to_csv(sys.stdout, index=False, columns=['a', 'b', 'c'])

a,b,c
1,2,3.0
5,6,
9,10,11.0

In [3]:
dates = pd.date_range('1/1/2000', periods=7)
ts = pd.Series(np.arange(7), index=dates)
ts.to_csv('examples/tseries.csv')

In [4]:
dates

DatetimeIndex(['2000-01-01', '2000-01-02', '2000-01-03', '2000-01-04',
               '2000-01-05', '2000-01-06', '2000-01-07'],
              dtype='datetime64[ns]', freq='D')

In [34]:
pd.DataFrame(ts)

            0
2000-01-01  0
2000-01-02  1
2000-01-03  2
2000-01-04  3
2000-01-05  4
2000-01-06  5
2000-01-07  6

In [35]:
df = pd.read_csv('examples/teste.csv')

In [37]:
df.columns = 'A B C D E F G'.split()

In [39]:
df.index = [1, 2, 3]

In [41]:
df.drop(1)

   A      B  C   D     E   F      G
2  1    two  5   6   NaN   8  world
3  2  three  9  10  11.0  12    foo

In [42]:
# Trabalhando com formatos delimitados

In [48]:
import csv

In [50]:
arquivo = open('examples/ex7.csv')
linhas = csv.reader(arquivo)
for linha in linhas:
    print(linha)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [51]:
def leitura(caminho):
    arquivo = open(caminho)
    linhas = csv.reader(arquivo)
    for linha in linhas:
        print(linha)

In [52]:
leitura('examples/ex7.csv')

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [53]:
with open('examples/ex7.csv') as f:
    lines = list(csv.reader(f))

[['a', 'b', 'c'], ['1', '2', '3'], ['1', '2', '3']]

In [54]:
lines

[['a', 'b', 'c'], ['1', '2', '3'], ['1', '2', '3']]

In [55]:
header, values = lines[0], lines[1:] # cabeçalho e valores

In [56]:
# Dados JSON

In [87]:
obj = """
    {"names": "Wes",
    "places_lived": ["United States", "Spain", "Germany"],
    "pet": null,
    "siblings": [{"age": 30, "names": "Scott", "pets": ["Zeus", "Zuko"]},
                {"age": 38,"names": "Katie",
                "pets": ["Sixes", "Stache", "Cisco"]}]
    }
    """
# Exemplos de JSON

In [88]:
obj

'\n    {"names": "Wes",\n    "places_lived": ["United States", "Spain", "Germany"],\n    "pet": null,\n    "siblings": [{"age": 30, "names": "Scott", "pets": ["Zeus", "Zuko"]},\n                {"age": 38,"names": "Katie",\n                "pets": ["Sixes", "Stache", "Cisco"]}]\n    }\n    '

In [89]:
import json
result = json.loads(obj) # Converte uma string JSON em formato Python

In [90]:
result

{'names': 'Wes',
 'places_lived': ['United States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'age': 30, 'names': 'Scott', 'pets': ['Zeus', 'Zuko']},
  {'age': 38, 'names': 'Katie', 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [69]:
asjson = json.dumps(result) # converte um objeto python de volta para JSON
asjson

'{"names": "Wes", "places_lived": ["United States", "Spain", "Germany"], "pet": null, "siblings": [{"names": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]}, {"names": "Katie", "age": 38, "pets": ["Sixes", "Stache", "Cisco"]}]}'

In [95]:
siblings = pd.DataFrame(result['siblings'], columns=['names', 'age']) # cuidado com a nomenclatura das colunas
siblings # é nomenclatura da coluna que vai ordenar o valor

   names  age
0  Scott   30
1  Katie   38

In [96]:
result['siblings']

[{'age': 30, 'names': 'Scott', 'pets': ['Zeus', 'Zuko']},
 {'age': 38, 'names': 'Katie', 'pets': ['Sixes', 'Stache', 'Cisco']}]

In [98]:
leitura('examples/example.json') # esquece os []  a mais, isso retorna um arquivo json

['[{"a": 1', ' "b": 2', ' "c": 3}', '']
[' {"a": 4', ' "b": 5', ' "c": 6}', '']
[' {"a": 7', ' "b": 8', ' "c": 9}]']

In [99]:
data = pd.read_json('examples/example.json')
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [100]:
print(data.to_json())

{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}

In [102]:
print(data.to_json(orient='records')) # salva um arquivo json, só falta colocar o nome do arquivo

[{"a":1,"b":2,"c":3},{"a":4,"b":5,"c":6},{"a":7,"b":8,"c":9}]

In [103]:
# XML e HTML: web scrapping

In [104]:
tables = pd.read_html('examples/fdic_failed_bank_list.html')

In [106]:
len(tables)

1

In [107]:
failures = tables[0]

In [108]:
failures.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"

In [109]:
close_timestamps = pd.to_datetime(failures['Closing Date'])
close_timestamps

0     2016-09-23
1     2016-08-19
2     2016-05-06
3     2016-04-29
4     2016-03-11
         ...
542   2001-07-27
543   2001-05-03
544   2001-02-02
545   2000-12-14
546   2000-10-13
Name: Closing Date, Length: 547, dtype: datetime64[ns]

In [117]:
close_timestamps.dt.year.value_counts() # dt datetime - year ano - value counts todos os valores AGREGADOS

2010    157
2009    140
2011     92
2012     51
2008     25
2013     24
2014     18
2002     11
2015      8
2016      5
2001      4
2004      4
2003      3
2007      3
2000      2
Name: Closing Date, dtype: int64

In [118]:
close_timestamps.dt.year # sem o value counts

0      2016
1      2016
2      2016
3      2016
4      2016
       ...
542    2001
543    2001
544    2001
545    2000
546    2000
Name: Closing Date, Length: 547, dtype: int64

In [125]:
# Formatos de dados binários - serialização embutida pickle de Python

In [128]:
frame = pd.read_csv('examples/ex1.csv')
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [129]:
frame.to_pickle('examples/frame_pickle') # escreve os dados em disco em formato pickle

In [131]:
pd.read_pickle('examples/frame_pickle') # é recomendado apenas como um formato de armazenagem de curta duração

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [133]:
# Usando o formato HDF5 - Trabalha com dados amplos

In [134]:
frame = pd.DataFrame({'a': np.random.randn(100)})
frame

           a
0  -2.491631
1   1.614969
2   0.520602
3   0.945991
4   0.242366
..       ...
95 -0.659057
96  0.172414
97 -0.440580
98  1.347704
99  0.854867

[100 rows x 1 columns]

In [139]:
# Erro de importação pip install tables

In [140]:
# Lendo arquivos do Microsoft Excel

In [22]:
xlsx = pd.ExcelFile('examples/ex1.xlsx')

In [23]:
pd.read_excel(xlsx, 'Sheet1')

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [24]:
frame = pd.read_excel('examples/ex1.xlsx', 'Sheet1')
frame

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [25]:
frame.drop('Unnamed: 0', axis=1, inplace=True)

In [26]:
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [32]:
writer = pd.ExcelWriter('examples/ex2.xlsx') # Escrever dados do pandas em formato excel - recebe o caminho
writer

In [33]:
frame.to_excel(writer, 'Sheet1') # pega os dados do frame e coloca no caminho

In [35]:
writer.save() # salva

In [36]:
# Interagindo com APIs web

In [37]:
import requests

In [38]:
url = 'https://api.github.com/repos/pandas-dev/pandas/issues'

In [40]:
resp = requests.get(url)
resp

In [41]:
data = resp.json()

In [42]:
data[0]

{'url': 'https://api.github.com/repos/pandas-dev/pandas/issues/43902',
 'repository_url': 'https://api.github.com/repos/pandas-dev/pandas',
 'labels_url': 'https://api.github.com/repos/pandas-dev/pandas/issues/43902/labels{/name}',
 'comments_url': 'https://api.github.com/repos/pandas-dev/pandas/issues/43902/comments',
 'events_url': 'https://api.github.com/repos/pandas-dev/pandas/issues/43902/events',
 'html_url': 'https://github.com/pandas-dev/pandas/issues/43902',
 'id': 1018924975,
 'node_id': 'I_kwDOAA0YD848u4-v',
 'number': 43902,
 'title': 'ENH: Feature Request for Ungroup Method for Grouped Data Frames',
 'user': {'login': 'mdancho84',
  'id': 13734662,
  'node_id': 'MDQ6VXNlcjEzNzM0NjYy',
  'avatar_url': 'https://avatars.githubusercontent.com/u/13734662?v=4',
  'gravatar_id': '',
  'url': 'https://api.github.com/users/mdancho84',
  'html_url': 'https://github.com/mdancho84',
  'followers_url': 'https://api.github.com/users/mdancho84/followers',
  'following_url': 'https://api.github.com/users/mdancho84/following{/other_user}',
  'gists_url': 'https://api.github.com/users/mdancho84/gists{/gist_id}',
  'starred_url': 'https://api.github.com/users/mdancho84/starred{/owner}{/repo}',
  'subscriptions_url': 'https://api.github.com/users/mdancho84/subscriptions',
  'organizations_url': 'https://api.github.com/users/mdancho84/orgs',
  'repos_url': 'https://api.github.com/users/mdancho84/repos',
  'events_url': 'https://api.github.com/users/mdancho84/events{/privacy}',
  'received_events_url': 'https://api.github.com/users/mdancho84/received_events',
  'type': 'User',
  'site_admin': False},
 'labels': [{'id': 76812,
   'node_id': 'MDU6TGFiZWw3NjgxMg==',
   'url': 'https://api.github.com/repos/pandas-dev/pandas/labels/Enhancement',
   'name': 'Enhancement',
   'color': '4E9A06',
   'default': False,
   'description': None},
  {'id': 233160,
   'node_id': 'MDU6TGFiZWwyMzMxNjA=',
   'url': 'https://api.github.com/repos/pandas-dev/pandas/labels/Groupby',
   'name': 'Groupby',
   'color': '729FCF',
   'default': False,
   'description': None}],
 'state': 'open',
 'locked': False,
 'assignee': None,
 'assignees': [],
 'milestone': None,
 'comments': 1,
 'created_at': '2021-10-06T18:23:46Z',
 'updated_at': '2021-10-06T19:10:26Z',
 'closed_at': None,
 'author_association': 'NONE',
 'active_lock_reason': None,
 'body': 'Hi, thanks for your work developing `pandas`. I\'d like to request a feature to add an ungroup() method for grouped data frames. It\'s related to this [StackOverflow](https://stackoverflow.com/questions/20122521/is-there-an-ungroup-by-operation-opposite-to-groupby-in-pandas/66879388#66879388) where I\'ve developed a hack to extract using the `.obj` to pull out the original data frame from the grouped data frame. \r\n\r\nHowever, it would be helpful to have a method developed, which would do the extraction to prevent users from depending on my hack. \r\n\r\n``` python\r\n>>> dat_1 = df.groupby("category_2")\r\n>>> dat_1\r\n<pandas.core.groupby.generic.DataFrameGroupBy object at 0x7fce78b3dd00>\r\n>>> dat_1.obj\r\n    order_date          category_2     value\r\n1   2011-02-01  Cross Country Race  324400.0\r\n2   2011-03-01  Cross Country Race  142000.0\r\n3   2011-04-01  Cross Country Race  498580.0\r\n4   2011-05-01  Cross Country Race  220310.0\r\n5   2011-06-01  Cross Country Race  364420.0\r\n..         ...                 ...       ...\r\n535 2015-08-01          Triathalon   39200.0\r\n536 2015-09-01          Triathalon   75600.0\r\n537 2015-10-01          Triathalon   58600.0\r\n538 2015-11-01          Triathalon   70050.0\r\n539 2015-12-01          Triathalon   38600.0\r\n\r\n[531 rows x 3 columns]\r\n```\r\n',
 'reactions': {'url': 'https://api.github.com/repos/pandas-dev/pandas/issues/43902/reactions',
  'total_count': 0,
  '+1': 0,
  '-1': 0,
  'laugh': 0,
  'hooray': 0,
  'confused': 0,
  'heart': 0,
  'rocket': 0,
  'eyes': 0},
 'timeline_url': 'https://api.github.com/repos/pandas-dev/pandas/issues/43902/timeline',
 'performed_via_github_app': None}

In [43]:
data[0]['title']

'ENH: Feature Request for Ungroup Method for Grouped Data Frames'

In [48]:
issues = pd.DataFrame(data, columns=['number', 'title', 'labels', 'state'])
issues.head()

,number,title,labels,state
0,43902,ENH: Feature Request for Ungroup Method for Gr...,"[{'id': 76812, 'node_id': 'MDU6TGFiZWw3NjgxMg=...",open
1,43901,ENH: Add support for more placeholders in `gue...,"[{'id': 76812, 'node_id': 'MDU6TGFiZWw3NjgxMg=...",open
2,43900,ENH: Add support for more placeholders in `gue...,"[{'id': 211840, 'node_id': 'MDU6TGFiZWwyMTE4ND...",open
3,43896,BUG: bug in DataFrame.groupby(Grouper) trigger...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
4,43894,"ENH: Add custom descriptors (such as dtype, nu...","[{'id': 76812, 'node_id': 'MDU6TGFiZWw3NjgxMg=...",open

In [49]:
# Interagindo com banco de dados

In [50]:
import sqlite3

In [51]:
query = """
    CREATE TABLE teste
    (a VARCHAR(20),
    b VARCHAR(20),
    c REAL, d INTEGER);
"""

In [52]:
con = sqlite3.connect('mydata.sqlite') # conectando

In [53]:
con.execute(query) # com a conexão executa as querys

In [54]:
con.commit()

In [55]:
data = [('Atlante', 'Georgia', 1.25, 6),
       ('Tallahassee', 'Florida', 2.6, 3),
       ('Sacramento', 'California', 1.7, 5)]

In [56]:
data

[('Atlante', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [58]:
stmt = "INSERT INTO teste VALUES(?, ?, ?, ?)"
con.executemany(stmt, data)
con.commit()

In [62]:
cursor = con.execute('select * from teste')

In [63]:
rows = cursor.fetchall()

In [64]:
rows

[('Atlante', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [65]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [66]:
pd.DataFrame(rows, columns= [x[0] for x in cursor.description])

             a           b     c  d
0      Atlante     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5

In [68]:
import sqlalchemy as sqla

In [70]:
db = sqla.create_engine('sqlite:///mydata.sqlite')

In [71]:
pd.read_sql('select * from teste', db)

             a           b     c  d
0      Atlante     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5